'''
5415. 圆形靶内的最大飞镖数量  显示英文描述
墙壁上挂着一个圆形的飞镖靶。现在请你蒙着眼睛向靶上投掷飞镖。
投掷到墙上的飞镖用二维平面上的点坐标数组表示。飞镖靶的半径为 r 。
请返回能够落在 任意 半径为 r 的圆形靶内或靶上的最大飞镖数。
'''


class Solution:
    def numPoints(self, points, r: int) -> int:
        return 0


so = Solution()

print(so.numPoints([[-2, 0], [2, 0], [0, 2], [0, -2]], 2) == 4)
print(so.numPoints([[-3, 0], [3, 0], [2, 6], [5, 4], [0, 9], [7, 8]], 5) == 5)
print(so.numPoints([[-2, 0], [2, 0], [0, 2], [0, -2]], 1) == 1)
print(so.numPoints([[1, 2], [3, 5], [1, -1], [2, 3], [4, 1], [1, 3]], 2) == 4)
